snlkuharlocal/src/Documents/ДДС_ВнешнихКонтрагентов/ДДС_ВнешнихКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДДС_ВнешнихКонтрагентов</name>
  <registerRecords>AccumulationRegister.ДДС_ВнешнихКонтрагентов</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.ТипыРасчетаДенежнымиСредствами</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/Enums/ТипыРасчетаДенежнымиСредствами/ТипыРасчетаДенежнымиСредствами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасчетаДенежнымиСредствами</name>
  <comment>Типы расчета денежными средствами для кассового чека</comment>
  <enumValues>
    <name>ПриходДенежныхСредств</name>
    <comment>Чек продажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредств</name>
    <comment>Чек возврата продажи</comment>
  </enumValues>
  <enumValues>
    <name>РасходДенежныхСредств</name>
    <comment>Чек покупки</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратРасходаДенежныхСредств</name>
    <comment>Чек возврата покупки</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ДДС_ВнешнихКонтрагентов/Forms/ФормаДокумента/Module.bsl
Процедура УправлениеВидимостью()	

			
	ТолькоПросмотр=НЕ МожноИзменятьДокумент(Объект.Ссылка);
 	Если ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	
КонецПроцедуры 


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Объект.Договор = Объект.контрагент.ОсновнойДоговор;
	// нечаева 04,12,25
	Объект.Валюта = Объект.Договор.ВалютаКредита;
    // нечаева 04,12,25
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
		 	
	Если объект.Контрагент <> Объект.Договор.владелец Тогда
		Объект.Контрагент = Объект.Договор.владелец;
	КонецЕсли;  
	
	Объект.Валюта = Объект.Договор.ВалютаКредита;
	 	
КонецПроцедуры  

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
	  УправлениеВидимостью();
	  
	//ЭтаФорма.ТекущийЭлемент = ЭлементыФормы.Контрагент;	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)  Тогда // проверить объект на то, что новый	
		Объект.Автор = ПараметрыСеанса.Пользователь;
		если ЗначениеЗаполнено(Объект.Договор)	тогда
			Объект.Валюта=Объект.Договор.ВалютаКредита;
		КонецЕсли;
		
		если НЕ ЗначениеЗаполнено(Объект.Валюта)	тогда
			Объект.Валюта=ПараметрыСеанса.ВалютаНац;  
			Объект.Курс=1;	
		КонецЕсли;
			
		Если Объект.КодОперации.Пустая() Тогда
			Объект.КодОперации=Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
		КонецЕсли;
				
	 КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры
